{
    "menuSection": "screens",
    "configItem": [
        {
            "name": "Экраны U8g2",
            "type": "Reading",
            "subtype": "U8g2lib",
            "id": "u8page",
            "widget": "",
            "page": "",
            "descr": "",

            "oledType": "SS_I2C",
            "int": 1,
            "update": 500,
            "font": "c6x13",
            "contrast": 90,
            "rotation": 90,
            "autoPage": 1,
            "pageTime": 3000,
            "id2show": "",
            
            "dc": 19,
            "cs": 5,
            "data": 23,
            "clock": 18,
            "rst": -1
        }
    ],
    "about": {
        "authorName": "Ilya Belyakov",
        "authorContact": "https://t.me/Biveraxe",
        "authorGit": "https://github.com/biveraxe",
        "specialThanks": "Yuriy Trikoz @ytrikoz",
        "moduleName": "U8g2lib",
        "moduleVersion": "1.0",
        "usedRam": {
            "esp32_4mb": 15,
            "esp8266_4mb": 15
        },
        "moduleDesc": "Позволяет выводить на графические экраны типа SSD, ST, SH указанные параметры из конфигурации IoTM.",
        "propInfo": {
            "oledType": "Строковый код типа дисплея. В текущей верссии поддерживаются ST7565 (ST), SSD1306 (SS_I2C), SSD1306 (SS_SPI) и SH1106 (SH). Для получения списка доступных типов дисплеев, обратитесь к документации библиотеки U8g2. Добавить возможность выбора типов дисплеев можно, добавив соответствующие условия в файл модуля в конструктор класса U8g2lib.",
            "int": "Интервал обновления экрана в секундах. Если указано 0, то обновление экрана не производится.",
            "update": "Интервал обновления экрана в миллисекундах. Если указано 0, то обновление экрана не производится. (парамтер на развитие)",
            "font": "Шрифт, используемый для отображения текста на экране. Доступные шрифты можно найти в документации библиотеки U8g2 и добавить в проект в функцию setFont().",
            "contrast": "Контрастность экрана. Значение от 10 до 150, где 0 - минимальная контрастность, а 255 - максимальная.",
            "rotation": "Поворот экрана в градусах. Доступные значения: 0, 90, 180, 270.",
            "autoPage": "Автоматическая смена страниц экрана. Если установлено в 1, то экран будет автоматически переключаться на следующую страницу после указанного времени.",
            "pageTime": "Время в миллисекундах, через которое будет происходить автоматическая смена страниц экрана. Используется только если autoPage установлено в 1.",
            "id2show": "Идентификатор элемента конфигурации, значение которого будет отображаться на экране. Если указано, то на экране будет отображаться только это значение. Возможно указать несколько идентификаторов, разделенных запятыми для перечисления горизонтально и # для перевода строки.",
            "dc": "Пин, используемый для управления дисплеем по протоколу I2C. Если не используется, укажите -1.",
            "cs": "Пин, используемый для управления дисплеем по протоколу SPI. Если не используется, укажите -1.",  
            "data": "Пин, используемый для передачи данных на дисплей по протоколу SPI. Если не используется, укажите -1.",
            "clock": "Пин, используемый для синхронизации данных на дисплее по протоколу SPI. Если не используется, укажите -1.",
            "rst": "Пин, используемый для сброса дисплея. Если не используется, укажите -1."
        },
        "title": "Дисплей U8g2lib",
        "funcInfo": [
            {
                "name": "nextPage",
                "descr": "Переключиться на следующую страницу",
                "params": []
            },
            {
                "name": "prevPage",
                "descr": "Переключиться на предыдущую страницу",
                "params": []
            },
            {
                "name": "rotPage",
                "descr": "Переключиться на следующую страницу с ротацией",
                "params": []
            },
            {
                "name": "gotoPage",
                "descr": "Переключиться на указанную страницу. Если номер не указать, то переключится на страницу закрепленную за элементом конфигурации.",
                "params": ["Номер страницы"]
            },
            {
                "name": "setAutoPage",
                "descr": "Установить автоматическую смену страниц.",
                "params": ["1 - включить, 0 - выключить"]
            }
        ]
    },
    "defActive": false,
    "usedLibs": {
        "esp32*": [
            "olikraus/U8g2 @ ^2.36.5"
        ],
        "esp82*": [
            "olikraus/U8g2 @ ^2.36.5"
        ]
    }
}